<?php
$clientA = new HproseHttpClient(MY_HTTP_HOST);

try {
    $objCode = json_decode($clientA->getCodeDetail());
} catch (Exception $e) {
    $re ['errMsg'] = $e->getMessage();
}
/*$to_return='';
try {
    $r1 =function($result, $args, $error) use (&$to_return){
       $to_return = empty($error)? $result: "已传参数 = <pre>".print_r($args,1)."</pre><br>错误信息请联系客服 :".$error;
       echo $to_return;
    };
    $clientA->getCodeDetail(' ', $r1);
} catch (Exception $e) {
    var_dump($e);die();
}*/
$host = $_SERVER['HTTP_HOST'];

$ip = CommonClass::get_user_ip();
//$config = $clientA->getSiteSet(SITE_ID);
//
//if (isset($config['api_config'])) {
//    foreach ($config['api_config'] as $k => $v) {
//        if ($k != 'SITE_ID') {
//            define($k, $v);
//        }
//    }
//} else {
//    echo "网络错误";
//    exit();
//}
$action = CommonClass::filter_input_init(INPUT_GET, 'action');
$json = CommonClass::filter_input_init(INPUT_GET, 'json');
$jsonpcallback = CommonClass::filter_input_init(INPUT_GET, 'callback');
$jsonp = $json ? $json : 'json';
$loginkeyb='Vru0UVbka0mTWtNH';//第三方登录
$formKeyType = [
    '10001' => '公司入款',
    '10002' => '公司入款优惠',
    '10003' => '公司汇款优惠',
    '10004' => '返点',
    '10005' => '线上存款',
    '10006' => '线上存款手续费',
    '10007' => '线上存款优惠',
    '10008' => '人工存入',
    '10009' => '出款',
    '10010' => '系统取消出款',
    '10011' => '人工存入取消出款',
    '10012' => '重复出款',
    '10013' => '沖銷',
    '10014' => '会员出款被扣除金额',
    '10015' => '给予反水',
    '10016' => '存款优惠',
    '10017' => '汇款优惠',
    '10018' => '退佣优惠',
    '10019' => '负数额度归零',
    '10020' => '重覆出款',
    '10021' => '其他人工存入',
    '10022' => '手动申请出款',
    '10023' => '放弃存款优惠',
    '10024' => '公司入款误存',
    '10025' => '会员负数回冲',
    '10026' => '扣除非法下注派彩',
    '10027' => '其他人工提出',
    '10028' => '系统-新增快开额度',
    '10029' => '活动优惠',
    '10030' => '返点优惠',
    '10031' => '回复删单',
    '10032' => '删单',
    '10033' => '手续费扣除',
    '10034' => '优惠金额扣除',
    '10035' => '球类返点',
    '10036' => '视讯返点',
    '10037' => '体育返点',
    '10038' => '机率返点',
    '10039' => '彩票返点',
    '10040' => '球类冲销',
    '10041' => '视讯冲销',
    '10042' => '体育冲销',
    '10043' => '机率冲销',
    '10044' => '彩票冲销',
    '10045' => '佣金返还',
    '10046' => '佣金注销',
    '10047' => '奖金提取',
    '10048' => '会员返水',
    '10049' => '除去会员返水',
    '10057' => '额度转入',
    '10058' => '额度转出',
    '10070' => '额度存入失败返还',
    '10071' => '额度转入失败返还',
    '10050' => '额度存入',
    '10051' => '额度提出',
    '10052' => '推广好友优惠',
    '10053' => '现金存入',
    '10054' => '现金提出',

    '10060' => '代理返水',
    '10061' => '除去代理返水',
    '10062' => '总代理返水',
    '10063' => '除去总代理返水',
    '10064' => '股东返水',
    '10065' => '除去股东返水',
    '10066' => '大股东返水',
    '10067' => '除去大股东返水',

    '20001' => 'DS主账户转至BBIN',
    '20002' => 'DS主账户转至AG',
    '20003' => 'DS主账户转至H8',
    '20004' => '由BBIN转入DS主账户',
    '20005' => '由AG转入DS主账户',
    '20006' => '由H8转入DS主账户',
    '20007' => 'DS主账户转至BBIN失败-返还',
    '20008' => 'DS主账户转至AG失败-返还',
    '20009' => 'DS主账户转至H8失败-返还',
    '20010' => 'DS主账户转至OG',
    '20011' => '由OG转入DS主账户',
    '20012' => 'DS主账户转至OG失败-返还',
    '20013' => '由MG转入DS主账户',
    '20014' => 'DS主账户转至MG',

    '30001' => 'BBIN投注',
    '30002' => 'AG投注',
    '30003' => 'H8投注',
    '30004' => 'BBIN派彩',
    '30005' => 'AG派彩',
    '30006' => 'H8派彩',
    '2000' => 'DS平台投注',
    '2001' => 'DS平台派彩',
    '30009' => 'DS传统彩投注',
    '30010' => 'DS传统彩派彩',
    '30011' => 'DS电子游戏投注',
    '30012' => 'DS电子游戏派彩',
    '50001' => 'DS分分彩投注',
    '50002' => 'DS分分彩派彩',
    '30013' => 'DS香港彩投注',
    '30014' => 'DS香港彩派彩',
    '30015' => 'DS经典彩投注',
    '30016' => 'DS经典彩派彩',
    '60000' => '代理平台转入',
    '60001' => '代理平台投注',
    //资金交易定义
    '70000' => 'PC28投注',
    '70001' => 'PC28派彩',
    '70002' => 'PC28返水',
    '70003' => 'PC28撤销',
    '70004' => 'PC28回滚',

     //积分部分(只能积分是字母形式)
    'ds_manniu_bet'=>'PC28下注',//'蛮牛下注'
    'cancel_bet'=>'注单取消',

    'ds_ag_live'=>'ag视讯下注',
    'ds_bbin_3d'=>'bbin_3d',
    'ds_bbin_jilv'=>'bbin_jilv',
    'ds_bbin_live'=>'bbin视讯',
    'ds_bbin_sport'=>'bbin体育',
    'ds_fenfen_lotto'=>'分分彩下注',
    'ds_jingdian_lottery'=>'经典彩下注',
    'ds_live'=>'ds视讯',
    'ds_lotto_bet'=>'lotto_bet',
    'ds_m8_sport'=>'m8_sport',
    'ds_mg_game'=>'mg电子游戏下注',
    'video_game_wager'=>'video_game_water',
    'LOTTERY_COST_POINT'=>'摇奖减积分',
    'CHECK_IN_POINT'=>'积分存入',
    'CHECK_OUT_POINT'=>'积分提出',
    'CHECK_SIGN_POINT'=>'签到加积分'
];